In [1]:
import pandas as pd

In [4]:
df = pd.read_csv(r"C:\Users\chiin\OneDrive\Escritorio\global_gpd\data\gdp_data.csv")

df.head()

  country_name country_code  year        value
0  Afghanistan          AFG  1960  537777811.1
1  Afghanistan          AFG  1961  548888895.6
2  Afghanistan          AFG  1962  546666677.8
3  Afghanistan          AFG  1963  751111191.1
4  Afghanistan          AFG  1964  800000044.4

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13365 entries, 0 to 13364
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   country_name  13365 non-null  object
 1   country_code  13365 non-null  object
 2   year          13365 non-null  int64
 3   value         13365 non-null  float64
dtypes: float64(1), int64(1), object(2)
memory usage: 417.8+ KB

In [6]:
df1 = pd.read_csv(r"C:\Users\chiin\OneDrive\Escritorio\global_gpd\data\country_codes.csv")

df1.head()

  country_code                     region         income_group
0          ABW  Latin America & Caribbean          High income
1          AFG                 South Asia           Low income
2          AGO         Sub-Saharan Africa  Lower middle income
3          ALB      Europe & Central Asia  Upper middle income
4          AND      Europe & Central Asia          High income

In [7]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 217 entries, 0 to 216
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   country_code  217 non-null    object
 1   region        217 non-null    object
 2   income_group  217 non-null    object
dtypes: object(3)
memory usage: 5.2+ KB